Indulge125/stm32-ota-bootloader/2-IO模拟IIC驱动24C02/Hardware/Key.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
void Key_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode= GPIO_Mode_IPU ; //上拉输入
	GPIO_InitStructure.GPIO_Pin= GPIO_Pin_1 | GPIO_Pin_11 ;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz ;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	GPIO_InitTypeDef GPIO_A;
	GPIO_A.GPIO_Mode= GPIO_Mode_IPU ; //上拉输入
	GPIO_A.GPIO_Pin= GPIO_Pin_5 | GPIO_Pin_7 ;
	GPIO_A.GPIO_Speed= GPIO_Speed_50MHz ;
	GPIO_Init(GPIOA,&GPIO_A);
	
}
uint8_t Key_GetNum(void)
{
	uint8_t KeyNum=0;
	if (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_1)==0)
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_1)==0);
		Delay_ms(20);
		KeyNum =1;
	}
	if (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_11)==0)
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_11)==0);
		Delay_ms(20);
		KeyNum =2;
	}
	if (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_5)==0)
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_5)==0);
		Delay_ms(20);
		KeyNum =3;
	}
	if (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_7)==0)
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_7)==0);
		Delay_ms(20);
		KeyNum =4;
	}
	return KeyNum;
}
